# merge

In [3]:
import pandas as pd

left = pd.DataFrame({'key':['K0','K1','K2','K3'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']})
right = pd.DataFrame({'key':['K0','K1','K2','K3'],
                     'C':['C0','C1','C2','C3'],
                     'D':['D0','D1','D2','D3']})


left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [4]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [5]:
# 将两个表按照相同的key 值合并起来

res = pd.merge(left,right)
res

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [25]:
res1 =  pd.merge(left,right,on = ['key'])    # 可以指定一下按什么来合并的  on = 【‘’】
res1

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [26]:
left1 = pd.DataFrame({'key1':['K0','K1','K2','K3'],
                   'key2':['K0','K1','K2','K3'],
                    'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3']})
right1 = pd.DataFrame({'key1':['K0','K1','K2','K3'],
                      'key2':['K0','K1','K2','K4'],
                     'C':['C0','C1','C2','C3'],
                     'D':['D0','D1','D2','D3']})
print(left1)
print(right1)

  key1 key2   A   B
0   K0   K0  A0  B0
1   K1   K1  A1  B1
2   K2   K2  A2  B2
3   K3   K3  A3  B3
  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K1  C1  D1
2   K2   K2  C2  D2
3   K3   K4  C3  D3

In [27]:
res = pd.merge(left1,right1,on = ['key1','key2'])     # 此时按照默认的情况下，on=。。。。，
                                                    #此时因为表2 的key 值不对应性，会少数据，要把单独的数据单列出来，可采用以下方法，
res

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K1  A1  B1  C1  D1
2   K2   K2  A2  B2  C2  D2

In [28]:
import pandas as pd

res = pd.merge(left1,right1,on = ['key1','key2'],how = 'outer')          #  how = 'outer'， 可以把单独的列出来
res

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K1   K1   A1   B1   C1   D1
2   K2   K2   A2   B2   C2   D2
3   K3   K3   A3   B3  NaN  NaN
4   K3   K4  NaN  NaN   C3   D3

很类似与数据库中的左连接，右连接

In [29]:
res = pd.merge(left1,right1,on = ['key1','key2'],how = 'outer',indicator = True)     # 可以指定指示器为True,indicator = True，
res

  key1 key2    A    B    C    D      _merge
0   K0   K0   A0   B0   C0   D0        both
1   K1   K1   A1   B1   C1   D1        both
2   K2   K2   A2   B2   C2   D2        both
3   K3   K3   A3   B3  NaN  NaN   left_only
4   K3   K4  NaN  NaN   C3   D3  right_only

In [33]:
res = pd.merge(left1,right1,how = 'right')              # 只要连接表，右边的所有数据，并且依据右表的key值找，左表与之相对应
res

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K1   A1   B1  C1  D1
2   K2   K2   A2   B2  C2  D2
3   K3   K4  NaN  NaN  C3  D3

#  pivot 数据透视表 8 - 显示设置

In [34]:
import pandas as pd

pd.get_option('display.max_rows',6)       # 查看数据最大展示行

60

In [37]:
pd.set_option('display.max_rows',6)           # 设置数据的最大展示行

In [38]:
pd.Series(index = range(0,100))

0    NaN
1    NaN
2    NaN
      ..
97   NaN
98   NaN
99   NaN
Length: 100, dtype: float64

In [41]:
pd.get_option('display.max_columns')           # 查看列的最大展示列数

20

In [42]:
pd.set_option('display.max_columns',6)       # 设置最大最大展示列数

In [46]:
pd.DataFrame(columns = range(0,30))          # 自己创建一个DataFrame 结构，设置列为0-30， 但是只展示6 列

Empty DataFrame
Columns: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29]
Index: []

[0 rows x 30 columns]

In [47]:
pd.get_option('display.max_colwidth')

50

In [56]:
pd.get_option('display.precision')             # 查看数据的精度

6

In [57]:
pd.Series(data = [1.23345678])

0    1.233457
dtype: float64

In [58]:
pd.set_option('display.precision',4)           # 修改精度

In [59]:
pd.Series(data =[1.234566])

0    1.2346
dtype: float64

#  9 -  pivot 操作， 数据透视表

In [61]:
import pandas as pd

example = pd.DataFrame({'Month':['January','January','January','January',
                                 'February','February','February','February',
                                 'March','March','March','March'],
                       'Category':['Transportation','Grocery','Household','Entertaionment',
                                  'Transportation','Grocery','Household','Entertaionment',
                                  'Transportati,on','Grocery','Household','Entertaionment'],
                       'Amount':[74,235,175,100,115,240,225,125,90,260,20,60]
                       })

In [62]:
example

      Month        Category  Amount
0   January  Transportation      74
1   January         Grocery     235
2   January       Household     175
..      ...             ...     ...
9     March         Grocery     260
10    March       Household      20
11    March  Entertaionment      60

[12 rows x 3 columns]

In [65]:
pd.get_option('display.max_rows')

6

In [66]:
pd.set_option('display.max_rows',20)

In [67]:
example

       Month         Category  Amount
0    January   Transportation      74
1    January          Grocery     235
2    January        Household     175
3    January   Entertaionment     100
4   February   Transportation     115
5   February          Grocery     240
6   February        Household     225
7   February   Entertaionment     125
8      March  Transportati,on      90
9      March          Grocery     260
10     March        Household      20
11     March   Entertaionment      60

In [69]:
# 查看 每个月的每一项花费的平均总和为多少,..... pivot（）函数，可以统计多元信息，相比groupby 要好用的多

example_pivot = example.pivot(index = 'Category',columns = 'Month',values = 'Amount')
example_pivot

Month            February  January  March
Category
Entertaionment      125.0    100.0   60.0
Grocery             240.0    235.0  260.0
Household           225.0    175.0   20.0
Transportati,on       NaN      NaN   90.0
Transportation      115.0     74.0    NaN

In [70]:
example_pivot.sum(axis = 1)                # 指定维度，按行统计总和

Category
Entertaionment     285.0
Grocery            735.0
Household          420.0
Transportati,on     90.0
Transportation     189.0
dtype: float64

In [72]:
example_pivot.sum(axis = 0)

Month
February    705.0
January     584.0
March       430.0
dtype: float64

In [74]:
df = pd.read_csv('./data/test.csv')
df.head()                                     # head（） 函数，默认展示前5 行数据

,Entry,Entry name,Protein names,Gene names,Length,Mass
0,A0A584,TVBK2_HUMAN,T cell receptor beta variable 11-2,TRBV11-2 TCRBV21S3A2N2T,115,"12,743"
1,Q9BXU3,TX13A_HUMAN,Testis-expressed protein 13A,TEX13A,409,"45,583"
2,Q15031,SYLM_HUMAN,"Probable leucine--tRNA ligase, mitochondrial (...",LARS2 KIAA0028,903,"101,976"
3,Q6PKC3,TXD11_HUMAN,Thioredoxin domain-containing protein 11 (EF-h...,TXNDC11 EFP1,985,"110,529"
4,P42681,TXK_HUMAN,Tyrosine-protein kinase TXK (EC 2.7.10.2) (Pro...,TXK PTK4 RLK,527,"61,258"

#  pivot_table---数据透视表： 统计数据相当方便

In [77]:
# 默认就是求平均值

#df.pivot_table(index = 'Sex',columns = 'Pclass',values = 'Fare')    # 此时可以统计不同的性别，在不同的船舱等级的花费是怎么样的

# 按性别进行分组，再统计性别的指标：Pclass,


# 也可以自己定义一些统计的方法,可以自己定义一个function，传进去参数，方法，统计中位数，或者是max最大值，均值mean,总计count

# df.pivot_table(index = 'Sex',columns = 'Pclass',values = 'Fare',aggfunc = 'max')
# df.pivot_table(index = 'Sex',columns = 'Pclass',values = 'Fare',aggfunc = 'count')

In [78]:
df.head()

,Entry,Entry name,Protein names,Gene names,Length,Mass
0,A0A584,TVBK2_HUMAN,T cell receptor beta variable 11-2,TRBV11-2 TCRBV21S3A2N2T,115,"12,743"
1,Q9BXU3,TX13A_HUMAN,Testis-expressed protein 13A,TEX13A,409,"45,583"
2,Q15031,SYLM_HUMAN,"Probable leucine--tRNA ligase, mitochondrial (...",LARS2 KIAA0028,903,"101,976"
3,Q6PKC3,TXD11_HUMAN,Thioredoxin domain-containing protein 11 (EF-h...,TXNDC11 EFP1,985,"110,529"
4,P42681,TXK_HUMAN,Tyrosine-protein kinase TXK (EC 2.7.10.2) (Pro...,TXK PTK4 RLK,527,"61,258"

In [87]:
df['unlite'] = df['Length'] <=200                  # 把长度小于等于2000 的数据赋值给另一个变量,判断之后，就是True ,False 结构
df['unlite']

0         True
1        False
2        False
3        False
4        False
5        False
6        False
7        False
8        False
9        False
         ...
20411    False
20412    False
20413    False
20414    False
20415     True
20416    False
20417    False
20418    False
20419    False
20420    False
Name: unlite, Length: 20421, dtype: bool

In [94]:
# 按照索引：上面的True 或者是False, 以Entry 为列，统计长度的平均值，并且返回数据


df.pivot_table(index = 'unlite',columns = 'Entry',values = 'Length',aggfunc = 'mean')

Entry   A0A024RBG1  A0A075B6H9  A0A075B6I0  ...  U3KPV4  W5XKT8  W6CW81
unlite                                      ...
False          NaN         NaN         NaN  ...   340.0   324.0     NaN
True         181.0       119.0       122.0  ...     NaN     NaN   113.0

[2 rows x 20421 columns]

# 10 -  时间操作

In [100]:
%matplotlib notebook
import datetime

# 自己创建了一个datetime及格式：(year = 2017,month = 3,day = 3,hour = 10,minute = 30)， 不固定

dt = datetime.datetime(year = 2017,month = 3,day = 3,hour = 10,minute = 30)
dt

datetime.datetime(2017, 3, 3, 10, 30)

In [101]:
type(dt)

datetime.datetime

In [102]:
print(dt)

2017-03-03 10:30:00

In [104]:
import pandas as pd
import numpy as np
import datetime as dat

ts = pd.Timestamp('2017-3-3')             # 查看当前的时间戳，精确到几分几秒,具体到当前这个时刻，这个点
ts

Timestamp('2017-03-03 00:00:00')

In [105]:
ts.month                            # 直接可以调用变量的各种属性，也可以进行加减乘除

3

In [106]:
ts.day

3

In [113]:
ts + pd.Timedelta('5 days')                   # 增加5 天，用Timedelta() 函数

Timestamp('2017-03-08 00:00:00')

笔记：
- 第一点：拿到数据之后要先进行一下转换，to_time（） 函数经常用

In [109]:
pd.to_datetime("23/3/2016")                       # 进行一下时间的转换，转换为标准格式: pandas 支持的格式

Timestamp('2016-03-23 00:00:00')

In [115]:
s = pd.Series(['2017-3-3 00:00:00','2019-3-3 00:00:00','2019-6-6 00:00:00'])
s

0    2017-3-3 00:00:00
1    2019-3-3 00:00:00
2    2019-6-6 00:00:00
dtype: object

构建一个时间序列

In [139]:
# 构建10 条数据的时间序列，间隔为12小时，

pd.Series(pd.date_range(start = '2019-3-3',periods = 10,freq = '12H'))

0   2019-03-03 00:00:00
1   2019-03-03 12:00:00
2   2019-03-04 00:00:00
3   2019-03-04 12:00:00
4   2019-03-05 00:00:00
5   2019-03-05 12:00:00
6   2019-03-06 00:00:00
7   2019-03-06 12:00:00
8   2019-03-07 00:00:00
9   2019-03-07 12:00:00
dtype: datetime64[ns]

In [ ]:
笔记：
- 第一点：先自己创建一个文件datetime.csv
- 第二点：设置datetime 数据的索引有两种方法

In [143]:
# import numpy as np
# %%matplotlib inline

# %%writefile datetime.csv
# 0 2019-3-3 
# # 1   2019-03-03 12:00:00
# # 2   2019-03-04 00:00:00
# # 3   2019-03-04 12:00:00
# # 4   2019-03-05 00:00:00
# # 5   2019-03-05 12:00:00
# # 6   2019-03-06 00:00:00
# # 7   2019-03-06 12:00:00
# # 8   2019-03-07 00:00:00
# # 9   2019-03-07 12:00:00


data = pd.read_csv('./data/csv/test.csv')        # 读进来一些数据
data.head()

,Entry,Entry name,Protein names,Gene names,Length,Mass
0,A0A584,TVBK2_HUMAN,T cell receptor beta variable 11-2,TRBV11-2 TCRBV21S3A2N2T,115,"12,743"
1,Q9BXU3,TX13A_HUMAN,Testis-expressed protein 13A,TEX13A,409,"45,583"
2,Q15031,SYLM_HUMAN,"Probable leucine--tRNA ligase, mitochondrial (...",LARS2 KIAA0028,903,"101,976"
3,Q6PKC3,TXD11_HUMAN,Thioredoxin domain-containing protein 11 (EF-h...,TXNDC11 EFP1,985,"110,529"
4,P42681,TXK_HUMAN,Tyrosine-protein kinase TXK (EC 2.7.10.2) (Pro...,TXK PTK4 RLK,527,"61,258"

In [146]:
# 设置索引的第一种方法

# data['Time'] = pd.to_datetime(data['Time'])              # 先将得到的数据转换为标准格式，再将其赋值给另外一个变量
# data = data.set_index('Time')                  # 设置data中的数据的索引为Time ,并把得到的datetime 的数据赋值给data 变量
# type(data)

In [152]:
# 设置索引的第二种方法

data = pd.read_csv('./data/csv/test.csv',index_col = 0,parse_dates = True)    

# parse_dates = True: 为True 时 ，就代表是以时间为索引的，默认是为false,此时是以第0 列：Entry 为索引

data.head()

,Entry name,Protein names,Gene names,Length,Mass
Entry,,,,,
A0A584,TVBK2_HUMAN,T cell receptor beta variable 11-2,TRBV11-2 TCRBV21S3A2N2T,115,"12,743"
Q9BXU3,TX13A_HUMAN,Testis-expressed protein 13A,TEX13A,409,"45,583"
Q15031,SYLM_HUMAN,"Probable leucine--tRNA ligase, mitochondrial (...",LARS2 KIAA0028,903,"101,976"
Q6PKC3,TXD11_HUMAN,Thioredoxin domain-containing protein 11 (EF-h...,TXNDC11 EFP1,985,"110,529"
P42681,TXK_HUMAN,Tyrosine-protein kinase TXK (EC 2.7.10.2) (Pro...,TXK PTK4 RLK,527,"61,258"

In [ ]:
# 取出一段时间，分析该段时间的发生事故情况

# data[pd..Timestamp('2017-3-3 10:00:00'):pd.Timestamp('2017-6-6 10:00:00')]    把时间进行切片，取出

In [153]:
# 要把某一个月份单独取出来

# data[data.index.month == 1]

In [154]:
# data.between_time('8:00','12:00')     # 此时按照时间为索引，取出该段时间的数据

# 重要的操作: resample()

In [ ]:
# data.resample('D').mean().head()              # 是对时间的重采样，，对时间求均值

In [ ]:
# data.resampl('D').mean().plot()                # plot（） 函数，可以进行画图统计展示